from openpyxl import *
from openpyxl.utils import *

def get_list():
    return [('魂光', '298001'), ('紫色天冰原狼1级','23002691'),
('橙色天冰原狼1级','23004991'),
('红色天冰原狼1级','23007291'),
('金色天冰原狼1级','23009591'),
('紫色地冰原狼1级','23025691'),
('橙色地冰原狼1级','23027991'),
('红色地冰原狼1级','23030291'),
('金色地冰原狼1级','23032591'),
('紫色荒冰原狼1级','23048691'),
('橙色荒冰原狼1级','23050991'),
('红色荒冰原狼1级','23053291'),
('金色荒冰原狼1级','23055591'),
('金色专属冰原狼1级','23078591'),
('紫色天驯鹿1级','23232691'),
('橙色天驯鹿1级','23234991'),
('红色天驯鹿1级','23237291'),
('金色天驯鹿1级','23239591'),
('紫色地驯鹿1级','23255691'),
('橙色地驯鹿1级','23257991'),
('红色地驯鹿1级','23260291'),
('金色地驯鹿1级','23262591'),
('紫色荒驯鹿1级','23278691'),
('橙色荒驯鹿1级','23280991'),
('红色荒驯鹿1级','23283291'),
('金色荒驯鹿1级','23285591'),
('金色专属驯鹿1级','23308591'),
('紫色天神火鹰1级','23462691'),
('橙色天神火鹰1级','23464991'),
('红色天神火鹰1级','23467291'),
('金色天神火鹰1级','23469591'),
('紫色地神火鹰1级','23485691'),
('橙色地神火鹰1级','23487991'),
('红色地神火鹰1级','23490291'),
('金色地神火鹰1级','23492591'),
('紫色荒神火鹰1级','23508691'),
('橙色荒神火鹰1级','23510991'),
('红色荒神火鹰1级','23513291'),
('金色荒神火鹰1级','23515591'),
('金色专属神火鹰1级','23538591'),
('紫色天激流鲨1级','23692691'),
('橙色天激流鲨1级','23694991'),
('红色天激流鲨1级','23697291'),
('金色天激流鲨1级','23699591'),
('紫色地激流鲨1级','23715691'),
('橙色地激流鲨1级','23717991'),
('红色地激流鲨1级','23720291'),
('金色地激流鲨1级','23722591'),
('紫色荒激流鲨1级','23738691'),
('橙色荒激流鲨1级','23740991'),
('红色荒激流鲨1级','23743291'),
('金色荒激流鲨1级','23745591'),
('金色专属激流鲨1级','23768591'),
('魂石随机宝箱(所有品质)','295116')]

def replace_cell(sheet, inx):
    s = sheet[inx].value
    if s == None: return
    list = get_list()
    print(s)
    
    for (s1, s2) in list:
        s = s.replace(s1, s2)
    sheet[inx] = s

def replace_ws(sheet, row1, row2):
    for row in range(row1, row2 + 1):
        replace_cell(sheet, get_column_letter(3) + str(row))
        replace_cell(sheet, get_column_letter(4) + str(row))

filename = 'in.xlsx'                                   # filename
wb = load_workbook(filename=filename)
replace_ws(wb['1'], 2, 136)
replace_ws(wb['2'], 2, 27)
replace_ws(wb['3'], 2, 19)
replace_ws(wb['4'], 2, 26)
wb.save(filename='in2.xlsx')